name: "test_train"
input: "data"
input_dim: 1
input_dim: 3
input_dim: 224
input_dim: 224

layer {
  name: "stage1_conv1"
  type: "Convolution"
  bottom: "data"
  top: "stage1_conv1"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
    group: 1
    stride: 2
  }
}
layer {
  name: "stage1_maxpool"
  type: "Pooling"
  bottom: "stage1_conv1"
  top: "stage1_maxpool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 1
  }
}
layer {
  name: "stage1_crop"
  type: "Crop"
  bottom: "stage1_maxpool"
  top: "stage1_crop"
  crop_param {
  	crop_h: 56 crop_w: 56
  }
}
layer {
  name: "stage2_0_avgpool"
  type: "Pooling"
  bottom: "stage1_crop"
  top: "stage2_0_avgpool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
    pad: 1
  }
}
layer {
  name: "stage2_0_crop"
  type: "Crop"
  bottom: "stage2_0_avgpool"
  top: "stage2_0_crop"
  crop_param {
  	crop_h: 28 crop_w: 28
  }
}
layer {
  name: "stage2_0_1x1_compress"
  type: "Convolution"
  bottom: "stage1_crop"
  top: "stage2_0_1x1_compress"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 60
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
  }
}
layer {
  name: "stage2_0_1x1_compress_bn"
  type: "BatchNorm"
  bottom: "stage2_0_1x1_compress"
  top: "stage2_0_1x1_compress_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage2_0_1x1_compress_scale"
  type: "Scale"
  bottom: "stage2_0_1x1_compress_bn"
  top: "stage2_0_1x1_compress_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage2_0_1x1_compress_relu"
  type: "ReLU"
  bottom: "stage2_0_1x1_compress_scale"
  top: "stage2_0_1x1_compress_relu"
}
layer {
  name: "stage2_0_channel_shuffle"
  type: "ChannelShuffle"
  bottom: "stage2_0_1x1_compress_relu"
  top: "stage2_0_channel_shuffle"
  channel_shuffle_param {
    group: 3
  }
}
layer {
  name: "stage2_0_depthwise_3x3"
  type: "Convolution"
  bottom: "stage2_0_channel_shuffle"
  top: "stage2_0_depthwise_3x3"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 60
    pad: 1
    kernel_size: 3
    group: 60
    stride: 2
  }
}
layer {
  name: "stage2_0_depthwise_3x3_bn"
  type: "BatchNorm"
  bottom: "stage2_0_depthwise_3x3"
  top: "stage2_0_depthwise_3x3_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage2_0_depthwise_3x3_scale"
  type: "Scale"
  bottom: "stage2_0_depthwise_3x3_bn"
  top: "stage2_0_depthwise_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage2_0_1x1_expand"
  type: "Convolution"
  bottom: "stage2_0_depthwise_3x3_scale"
  top: "stage2_0_1x1_expand"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 216
    pad: 0
    kernel_size: 1
    group: 3
    stride: 1
  }
}
layer {
  name: "stage2_0_1x1_expand_bn"
  type: "BatchNorm"
  bottom: "stage2_0_1x1_expand"
  top: "stage2_0_1x1_expand_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage2_0_1x1_expand_scale"
  type: "Scale"
  bottom: "stage2_0_1x1_expand_bn"
  top: "stage2_0_1x1_expand_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage2_0_concat"
  type: "Concat"
  bottom: "stage2_0_crop"
  bottom: "stage2_0_1x1_expand_scale"
  top: "stage2_0_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "stage2_0_final_relu"
  type: "ReLU"
  bottom: "stage2_0_concat"
  top: "stage2_0_final_relu"
}
layer {
  name: "stage2_1_1x1_compress"
  type: "Convolution"
  bottom: "stage2_0_final_relu"
  top: "stage2_1_1x1_compress"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 60
    pad: 0
    kernel_size: 1
    group: 3
    stride: 1
  }
}
layer {
  name: "stage2_1_1x1_compress_bn"
  type: "BatchNorm"
  bottom: "stage2_1_1x1_compress"
  top: "stage2_1_1x1_compress_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage2_1_1x1_compress_scale"
  type: "Scale"
  bottom: "stage2_1_1x1_compress_bn"
  top: "stage2_1_1x1_compress_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage2_1_1x1_compress_relu"
  type: "ReLU"
  bottom: "stage2_1_1x1_compress_scale"
  top: "stage2_1_1x1_compress_relu"
}
layer {
  name: "stage2_1_channel_shuffle"
  type: "ChannelShuffle"
  bottom: "stage2_1_1x1_compress_relu"
  top: "stage2_1_channel_shuffle"
  channel_shuffle_param {
    group: 3
  }
}
layer {
  name: "stage2_1_depthwise_3x3"
  type: "Convolution"
  bottom: "stage2_1_channel_shuffle"
  top: "stage2_1_depthwise_3x3"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 60
    pad: 1
    kernel_size: 3
    group: 60
    stride: 1
  }
}
layer {
  name: "stage2_1_depthwise_3x3_bn"
  type: "BatchNorm"
  bottom: "stage2_1_depthwise_3x3"
  top: "stage2_1_depthwise_3x3_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage2_1_depthwise_3x3_scale"
  type: "Scale"
  bottom: "stage2_1_depthwise_3x3_bn"
  top: "stage2_1_depthwise_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage2_1_1x1_expand"
  type: "Convolution"
  bottom: "stage2_1_depthwise_3x3_scale"
  top: "stage2_1_1x1_expand"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 240
    pad: 0
    kernel_size: 1
    group: 3
    stride: 1
  }
}
layer {
  name: "stage2_1_1x1_expand_bn"
  type: "BatchNorm"
  bottom: "stage2_1_1x1_expand"
  top: "stage2_1_1x1_expand_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage2_1_1x1_expand_scale"
  type: "Scale"
  bottom: "stage2_1_1x1_expand_bn"
  top: "stage2_1_1x1_expand_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage2_1_add"
  type: "Eltwise"
  bottom: "stage2_0_final_relu"
  bottom: "stage2_1_1x1_expand_scale"
  top: "stage2_1_add"
}
layer {
  name: "stage2_1_final_relu"
  type: "ReLU"
  bottom: "stage2_1_add"
  top: "stage2_1_final_relu"
}
layer {
  name: "stage2_2_1x1_compress"
  type: "Convolution"
  bottom: "stage2_1_final_relu"
  top: "stage2_2_1x1_compress"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 60
    pad: 0
    kernel_size: 1
    group: 3
    stride: 1
  }
}
layer {
  name: "stage2_2_1x1_compress_bn"
  type: "BatchNorm"
  bottom: "stage2_2_1x1_compress"
  top: "stage2_2_1x1_compress_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage2_2_1x1_compress_scale"
  type: "Scale"
  bottom: "stage2_2_1x1_compress_bn"
  top: "stage2_2_1x1_compress_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage2_2_1x1_compress_relu"
  type: "ReLU"
  bottom: "stage2_2_1x1_compress_scale"
  top: "stage2_2_1x1_compress_relu"
}
layer {
  name: "stage2_2_channel_shuffle"
  type: "ChannelShuffle"
  bottom: "stage2_2_1x1_compress_relu"
  top: "stage2_2_channel_shuffle"
  channel_shuffle_param {
    group: 3
  }
}
layer {
  name: "stage2_2_depthwise_3x3"
  type: "Convolution"
  bottom: "stage2_2_channel_shuffle"
  top: "stage2_2_depthwise_3x3"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 60
    pad: 1
    kernel_size: 3
    group: 60
    stride: 1
  }
}
layer {
  name: "stage2_2_depthwise_3x3_bn"
  type: "BatchNorm"
  bottom: "stage2_2_depthwise_3x3"
  top: "stage2_2_depthwise_3x3_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage2_2_depthwise_3x3_scale"
  type: "Scale"
  bottom: "stage2_2_depthwise_3x3_bn"
  top: "stage2_2_depthwise_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage2_2_1x1_expand"
  type: "Convolution"
  bottom: "stage2_2_depthwise_3x3_scale"
  top: "stage2_2_1x1_expand"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 240
    pad: 0
    kernel_size: 1
    group: 3
    stride: 1
  }
}
layer {
  name: "stage2_2_1x1_expand_bn"
  type: "BatchNorm"
  bottom: "stage2_2_1x1_expand"
  top: "stage2_2_1x1_expand_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage2_2_1x1_expand_scale"
  type: "Scale"
  bottom: "stage2_2_1x1_expand_bn"
  top: "stage2_2_1x1_expand_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage2_2_add"
  type: "Eltwise"
  bottom: "stage2_1_final_relu"
  bottom: "stage2_2_1x1_expand_scale"
  top: "stage2_2_add"
}
layer {
  name: "stage2_2_final_relu"
  type: "ReLU"
  bottom: "stage2_2_add"
  top: "stage2_2_final_relu"
}
layer {
  name: "stage2_3_1x1_compress"
  type: "Convolution"
  bottom: "stage2_2_final_relu"
  top: "stage2_3_1x1_compress"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 60
    pad: 0
    kernel_size: 1
    group: 3
    stride: 1
  }
}
layer {
  name: "stage2_3_1x1_compress_bn"
  type: "BatchNorm"
  bottom: "stage2_3_1x1_compress"
  top: "stage2_3_1x1_compress_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage2_3_1x1_compress_scale"
  type: "Scale"
  bottom: "stage2_3_1x1_compress_bn"
  top: "stage2_3_1x1_compress_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage2_3_1x1_compress_relu"
  type: "ReLU"
  bottom: "stage2_3_1x1_compress_scale"
  top: "stage2_3_1x1_compress_relu"
}
layer {
  name: "stage2_3_channel_shuffle"
  type: "ChannelShuffle"
  bottom: "stage2_3_1x1_compress_relu"
  top: "stage2_3_channel_shuffle"
  channel_shuffle_param {
    group: 3
  }
}
layer {
  name: "stage2_3_depthwise_3x3"
  type: "Convolution"
  bottom: "stage2_3_channel_shuffle"
  top: "stage2_3_depthwise_3x3"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 60
    pad: 1
    kernel_size: 3
    group: 60
    stride: 1
  }
}
layer {
  name: "stage2_3_depthwise_3x3_bn"
  type: "BatchNorm"
  bottom: "stage2_3_depthwise_3x3"
  top: "stage2_3_depthwise_3x3_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage2_3_depthwise_3x3_scale"
  type: "Scale"
  bottom: "stage2_3_depthwise_3x3_bn"
  top: "stage2_3_depthwise_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage2_3_1x1_expand"
  type: "Convolution"
  bottom: "stage2_3_depthwise_3x3_scale"
  top: "stage2_3_1x1_expand"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 240
    pad: 0
    kernel_size: 1
    group: 3
    stride: 1
  }
}
layer {
  name: "stage2_3_1x1_expand_bn"
  type: "BatchNorm"
  bottom: "stage2_3_1x1_expand"
  top: "stage2_3_1x1_expand_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage2_3_1x1_expand_scale"
  type: "Scale"
  bottom: "stage2_3_1x1_expand_bn"
  top: "stage2_3_1x1_expand_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage2_3_add"
  type: "Eltwise"
  bottom: "stage2_2_final_relu"
  bottom: "stage2_3_1x1_expand_scale"
  top: "stage2_3_add"
}
layer {
  name: "stage2_3_final_relu"
  type: "ReLU"
  bottom: "stage2_3_add"
  top: "stage2_3_final_relu"
}
layer {
  name: "stage3_0_avgpool"
  type: "Pooling"
  bottom: "stage2_3_final_relu"
  top: "stage3_0_avgpool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
    pad: 1
  }
}
layer {
  name: "stage3_0_crop"
  type: "Crop"
  bottom: "stage3_0_avgpool"
  top: "stage3_0_crop"
  crop_param {
  	crop_h: 14 crop_w: 14
  }
}
layer {
  name: "stage3_0_1x1_compress"
  type: "Convolution"
  bottom: "stage2_3_final_relu"
  top: "stage3_0_1x1_compress"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 120
    pad: 0
    kernel_size: 1
    group: 3
    stride: 1
  }
}
layer {
  name: "stage3_0_1x1_compress_bn"
  type: "BatchNorm"
  bottom: "stage3_0_1x1_compress"
  top: "stage3_0_1x1_compress_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage3_0_1x1_compress_scale"
  type: "Scale"
  bottom: "stage3_0_1x1_compress_bn"
  top: "stage3_0_1x1_compress_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage3_0_1x1_compress_relu"
  type: "ReLU"
  bottom: "stage3_0_1x1_compress_scale"
  top: "stage3_0_1x1_compress_relu"
}
layer {
  name: "stage3_0_channel_shuffle"
  type: "ChannelShuffle"
  bottom: "stage3_0_1x1_compress_relu"
  top: "stage3_0_channel_shuffle"
  channel_shuffle_param {
    group: 3
  }
}
layer {
  name: "stage3_0_depthwise_3x3"
  type: "Convolution"
  bottom: "stage3_0_channel_shuffle"
  top: "stage3_0_depthwise_3x3"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 120
    pad: 1
    kernel_size: 3
    group: 120
    stride: 2
  }
}
layer {
  name: "stage3_0_depthwise_3x3_bn"
  type: "BatchNorm"
  bottom: "stage3_0_depthwise_3x3"
  top: "stage3_0_depthwise_3x3_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage3_0_depthwise_3x3_scale"
  type: "Scale"
  bottom: "stage3_0_depthwise_3x3_bn"
  top: "stage3_0_depthwise_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage3_0_1x1_expand"
  type: "Convolution"
  bottom: "stage3_0_depthwise_3x3_scale"
  top: "stage3_0_1x1_expand"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 240
    pad: 0
    kernel_size: 1
    group: 3
    stride: 1
  }
}
layer {
  name: "stage3_0_1x1_expand_bn"
  type: "BatchNorm"
  bottom: "stage3_0_1x1_expand"
  top: "stage3_0_1x1_expand_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage3_0_1x1_expand_scale"
  type: "Scale"
  bottom: "stage3_0_1x1_expand_bn"
  top: "stage3_0_1x1_expand_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage3_0_concat"
  type: "Concat"
  bottom: "stage3_0_crop"
  bottom: "stage3_0_1x1_expand_scale"
  top: "stage3_0_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "stage3_0_final_relu"
  type: "ReLU"
  bottom: "stage3_0_concat"
  top: "stage3_0_final_relu"
}
layer {
  name: "stage3_1_1x1_compress"
  type: "Convolution"
  bottom: "stage3_0_final_relu"
  top: "stage3_1_1x1_compress"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 120
    pad: 0
    kernel_size: 1
    group: 3
    stride: 1
  }
}
layer {
  name: "stage3_1_1x1_compress_bn"
  type: "BatchNorm"
  bottom: "stage3_1_1x1_compress"
  top: "stage3_1_1x1_compress_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage3_1_1x1_compress_scale"
  type: "Scale"
  bottom: "stage3_1_1x1_compress_bn"
  top: "stage3_1_1x1_compress_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage3_1_1x1_compress_relu"
  type: "ReLU"
  bottom: "stage3_1_1x1_compress_scale"
  top: "stage3_1_1x1_compress_relu"
}
layer {
  name: "stage3_1_channel_shuffle"
  type: "ChannelShuffle"
  bottom: "stage3_1_1x1_compress_relu"
  top: "stage3_1_channel_shuffle"
  channel_shuffle_param {
    group: 3
  }
}
layer {
  name: "stage3_1_depthwise_3x3"
  type: "Convolution"
  bottom: "stage3_1_channel_shuffle"
  top: "stage3_1_depthwise_3x3"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 120
    pad: 1
    kernel_size: 3
    group: 120
    stride: 1
  }
}
layer {
  name: "stage3_1_depthwise_3x3_bn"
  type: "BatchNorm"
  bottom: "stage3_1_depthwise_3x3"
  top: "stage3_1_depthwise_3x3_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage3_1_depthwise_3x3_scale"
  type: "Scale"
  bottom: "stage3_1_depthwise_3x3_bn"
  top: "stage3_1_depthwise_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage3_1_1x1_expand"
  type: "Convolution"
  bottom: "stage3_1_depthwise_3x3_scale"
  top: "stage3_1_1x1_expand"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 480
    pad: 0
    kernel_size: 1
    group: 3
    stride: 1
  }
}
layer {
  name: "stage3_1_1x1_expand_bn"
  type: "BatchNorm"
  bottom: "stage3_1_1x1_expand"
  top: "stage3_1_1x1_expand_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage3_1_1x1_expand_scale"
  type: "Scale"
  bottom: "stage3_1_1x1_expand_bn"
  top: "stage3_1_1x1_expand_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage3_1_add"
  type: "Eltwise"
  bottom: "stage3_0_final_relu"
  bottom: "stage3_1_1x1_expand_scale"
  top: "stage3_1_add"
}
layer {
  name: "stage3_1_final_relu"
  type: "ReLU"
  bottom: "stage3_1_add"
  top: "stage3_1_final_relu"
}
layer {
  name: "stage3_2_1x1_compress"
  type: "Convolution"
  bottom: "stage3_1_final_relu"
  top: "stage3_2_1x1_compress"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 120
    pad: 0
    kernel_size: 1
    group: 3
    stride: 1
  }
}
layer {
  name: "stage3_2_1x1_compress_bn"
  type: "BatchNorm"
  bottom: "stage3_2_1x1_compress"
  top: "stage3_2_1x1_compress_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage3_2_1x1_compress_scale"
  type: "Scale"
  bottom: "stage3_2_1x1_compress_bn"
  top: "stage3_2_1x1_compress_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage3_2_1x1_compress_relu"
  type: "ReLU"
  bottom: "stage3_2_1x1_compress_scale"
  top: "stage3_2_1x1_compress_relu"
}
layer {
  name: "stage3_2_channel_shuffle"
  type: "ChannelShuffle"
  bottom: "stage3_2_1x1_compress_relu"
  top: "stage3_2_channel_shuffle"
  channel_shuffle_param {
    group: 3
  }
}
layer {
  name: "stage3_2_depthwise_3x3"
  type: "Convolution"
  bottom: "stage3_2_channel_shuffle"
  top: "stage3_2_depthwise_3x3"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 120
    pad: 1
    kernel_size: 3
    group: 120
    stride: 1
  }
}
layer {
  name: "stage3_2_depthwise_3x3_bn"
  type: "BatchNorm"
  bottom: "stage3_2_depthwise_3x3"
  top: "stage3_2_depthwise_3x3_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage3_2_depthwise_3x3_scale"
  type: "Scale"
  bottom: "stage3_2_depthwise_3x3_bn"
  top: "stage3_2_depthwise_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage3_2_1x1_expand"
  type: "Convolution"
  bottom: "stage3_2_depthwise_3x3_scale"
  top: "stage3_2_1x1_expand"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 480
    pad: 0
    kernel_size: 1
    group: 3
    stride: 1
  }
}
layer {
  name: "stage3_2_1x1_expand_bn"
  type: "BatchNorm"
  bottom: "stage3_2_1x1_expand"
  top: "stage3_2_1x1_expand_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage3_2_1x1_expand_scale"
  type: "Scale"
  bottom: "stage3_2_1x1_expand_bn"
  top: "stage3_2_1x1_expand_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage3_2_add"
  type: "Eltwise"
  bottom: "stage3_1_final_relu"
  bottom: "stage3_2_1x1_expand_scale"
  top: "stage3_2_add"
}
layer {
  name: "stage3_2_final_relu"
  type: "ReLU"
  bottom: "stage3_2_add"
  top: "stage3_2_final_relu"
}
layer {
  name: "stage3_3_1x1_compress"
  type: "Convolution"
  bottom: "stage3_2_final_relu"
  top: "stage3_3_1x1_compress"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 120
    pad: 0
    kernel_size: 1
    group: 3
    stride: 1
  }
}
layer {
  name: "stage3_3_1x1_compress_bn"
  type: "BatchNorm"
  bottom: "stage3_3_1x1_compress"
  top: "stage3_3_1x1_compress_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage3_3_1x1_compress_scale"
  type: "Scale"
  bottom: "stage3_3_1x1_compress_bn"
  top: "stage3_3_1x1_compress_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage3_3_1x1_compress_relu"
  type: "ReLU"
  bottom: "stage3_3_1x1_compress_scale"
  top: "stage3_3_1x1_compress_relu"
}
layer {
  name: "stage3_3_channel_shuffle"
  type: "ChannelShuffle"
  bottom: "stage3_3_1x1_compress_relu"
  top: "stage3_3_channel_shuffle"
  channel_shuffle_param {
    group: 3
  }
}
layer {
  name: "stage3_3_depthwise_3x3"
  type: "Convolution"
  bottom: "stage3_3_channel_shuffle"
  top: "stage3_3_depthwise_3x3"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 120
    pad: 1
    kernel_size: 3
    group: 120
    stride: 1
  }
}
layer {
  name: "stage3_3_depthwise_3x3_bn"
  type: "BatchNorm"
  bottom: "stage3_3_depthwise_3x3"
  top: "stage3_3_depthwise_3x3_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage3_3_depthwise_3x3_scale"
  type: "Scale"
  bottom: "stage3_3_depthwise_3x3_bn"
  top: "stage3_3_depthwise_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage3_3_1x1_expand"
  type: "Convolution"
  bottom: "stage3_3_depthwise_3x3_scale"
  top: "stage3_3_1x1_expand"
  param {
    lr_mult: 0.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 480
    pad: 0
    kernel_size: 1
    group: 3
    stride: 1
  }
}
layer {
  name: "stage3_3_1x1_expand_bn"
  type: "BatchNorm"
  bottom: "stage3_3_1x1_expand"
  top: "stage3_3_1x1_expand_bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "stage3_3_1x1_expand_scale"
  type: "Scale"
  bottom: "stage3_3_1x1_expand_bn"
  top: "stage3_3_1x1_expand_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stage3_3_add"
  type: "Eltwise"
  bottom: "stage3_2_final_relu"
  bottom: "stage3_3_1x1_expand_scale"
  top: "stage3_3_add"
}
layer {
  name: "stage3_3_final_relu"
  type: "ReLU"
  bottom: "stage3_3_add"
  top: "stage3_3_final_relu"
}
layer {
  name: "avg_pooling"
  type: "Pooling"
  bottom: "stage3_3_final_relu"
  top: "avg_pooling"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "max_pooling"
  type: "Pooling"
  bottom: "stage3_3_final_relu"
  top: "max_pooling"
  pooling_param {
    pool: MAX
    global_pooling: true
  }
}
layer {
  name: "global_pooling"
  type: "Eltwise"
  bottom: "max_pooling"
  bottom: "avg_pooling"
  top: "global_pooling"
}
layer {
  name: "flatten"
  type: "Flatten"
  bottom: "global_pooling"
  top: "flatten"
  flatten_param {
    axis: 1
  }
}
layer {
  name: "fc_0"
  type: "InnerProduct"
  bottom: "flatten"
  top: "fc_0"
  inner_product_param {
    num_output: 1
  }
}
layer {
  name: "sigmoid_0"
  type: "Sigmoid"
  bottom: "fc_0"
  top: "sigmoid_0"
}
layer {
  name: "fc_1"
  type: "InnerProduct"
  bottom: "flatten"
  top: "fc_1"
  inner_product_param {
    num_output: 1
  }
}
layer {
  name: "fc_2"
  type: "InnerProduct"
  bottom: "flatten"
  top: "fc_2"
  inner_product_param {
    num_output: 1
  }
}
layer {
  name: "sigmoid_2"
  type: "Sigmoid"
  bottom: "fc_2"
  top: "sigmoid_2"
}
layer {
  name: "final_concat"
  type: "Concat"
  bottom: "sigmoid_0"
  bottom: "fc_1"
  bottom: "sigmoid_2"
  top: "final_concat"
  concat_param {
    axis: 1
  }
}
